In [1]:
import pandas as pd
import numpy as np
from scipy.sparse import csr_matrix

In [2]:
ratingCols = ['UserID','MovieID','Rating','Timestamp']
ratings = pd.read_csv('ml-1m/ratings.dat', sep='::', engine='python',header=None,names=ratingCols)
ratings.head()

   UserID  MovieID  Rating  Timestamp
0       1     1193       5  978300760
1       1      661       3  978302109
2       1      914       3  978301968
3       1     3408       4  978300275
4       1     2355       5  978824291

In [3]:
userCols = ['UserID','Gender','Age','Occupation','Zip-code']
users = pd.read_csv('ml-1m/users.dat', sep='::', engine='python',header=None,names=userCols)
users.head()

   UserID Gender  Age  Occupation Zip-code
0       1      F    1          10    48067
1       2      M   56          16    70072
2       3      M   25          15    55117
3       4      M   45           7    02460
4       5      M   25          20    55455

In [4]:
movieCols = ['MovieID','Title','Genres']
movies = pd.read_csv('ml-1m/movies.dat', sep='::', engine='python',header=None,names=movieCols)
movies.head()

   MovieID                               Title                        Genres
0        1                    Toy Story (1995)   Animation|Children's|Comedy
1        2                      Jumanji (1995)  Adventure|Children's|Fantasy
2        3             Grumpier Old Men (1995)                Comedy|Romance
3        4            Waiting to Exhale (1995)                  Comedy|Drama
4        5  Father of the Bride Part II (1995)                        Comedy

In [5]:
#Starting the process to remove the lesser known movies to remove noise
merge_movie_ratings = pd.merge(ratings,movies,on='MovieID')
drop_extra_columns = ['Timestamp','Genres']
merge_movie_ratings = merge_movie_ratings.drop(drop_extra_columns,axis=1)
merge_movie_ratings.head()

   UserID  MovieID  Rating                                   Title
0       1     1193       5  One Flew Over the Cuckoo's Nest (1975)
1       2     1193       5  One Flew Over the Cuckoo's Nest (1975)
2      12     1193       4  One Flew Over the Cuckoo's Nest (1975)
3      15     1193       4  One Flew Over the Cuckoo's Nest (1975)
4      17     1193       5  One Flew Over the Cuckoo's Nest (1975)

In [6]:
merge_movie_ratings = merge_movie_ratings.dropna(axis = 0, subset=['Title'])

In [7]:
movie_ratingCount = (merge_movie_ratings.groupby(by = ['Title'])['Rating'].count().reset_index())
movie_ratingCount.head()

                           Title  Rating
0         $1,000,000 Duck (1971)      37
1           'Night Mother (1986)      70
2      'Til There Was You (1997)      52
3             'burbs, The (1989)     303
4  ...And Justice for All (1979)     199

In [8]:
#Now Renaming the columns in movie_ratingCount
#movie_ratingCount = movie_ratingCount.rename(columns={'Title':'Rating'})[['movieTitle','totalRating']]
movie_ratingCount.columns = ['Title','totalRating']
movie_ratingCount.head()

                           Title  totalRating
0         $1,000,000 Duck (1971)           37
1           'Night Mother (1986)           70
2      'Til There Was You (1997)           52
3             'burbs, The (1989)          303
4  ...And Justice for All (1979)          199

In [9]:
rating_with_totalRating = merge_movie_ratings.merge(movie_ratingCount,left_on='Title',right_on='Title',how='left')
rating_with_totalRating.head()

,UserID,MovieID,Rating,Title,totalRating
0,1,1193,5,One Flew Over the Cuckoo's Nest (1975),1725
1,2,1193,5,One Flew Over the Cuckoo's Nest (1975),1725
2,12,1193,4,One Flew Over the Cuckoo's Nest (1975),1725
3,15,1193,4,One Flew Over the Cuckoo's Nest (1975),1725
4,17,1193,5,One Flew Over the Cuckoo's Nest (1975),1725

In [10]:
print(rating_with_totalRating)

         UserID  MovieID  Rating  \
0             1     1193       5
1             2     1193       5
2            12     1193       4
3            15     1193       4
4            17     1193       5
5            18     1193       4
6            19     1193       5
7            24     1193       5
8            28     1193       3
9            33     1193       5
10           39     1193       5
11           42     1193       3
12           44     1193       4
13           47     1193       4
14           48     1193       4
15           49     1193       4
16           53     1193       5
17           54     1193       5
18           58     1193       5
19           59     1193       4
20           62     1193       4
21           80     1193       4
22           81     1193       5
23           88     1193       5
24           89     1193       5
25           95     1193       5
26           96     1193       3
27           99     1193       2
28          102     1193       5
29          104     1193       2
...         ...      ...     ...
1000179    4933     3084       3
1000180    4802     2218       2
1000181    4812     2308       2
1000182    4874      624       4
1000183    5059     1434       4
1000184    5947     1434       4
1000185    5077     1868       3
1000186    5944     1868       1
1000187    5105      404       3
1000188    5185      404       4
1000189    5532      404       5
1000190    5543      404       3
1000191    5220     2543       3
1000192    5754     2543       4
1000193    5227      591       3
1000194    5795      591       1
1000195    5313     3656       5
1000196    5328     2438       4
1000197    5334     3323       3
1000198    5334      127       1
1000199    5334     3382       5
1000200    5420     1843       3
1000201    5433      286       3
1000202    5494     3530       4
1000203    5556     2198       3
1000204    5949     2198       5
1000205    5675     2703       3
1000206    5780     2845       1
1000207    5851     3607       5
1000208    5938     2909       4

                                                     Title  totalRating
0                   One Flew Over the Cuckoo's Nest (1975)         1725
1                   One Flew Over the Cuckoo's Nest (1975)         1725
2                   One Flew Over the Cuckoo's Nest (1975)         1725
3                   One Flew Over the Cuckoo's Nest (1975)         1725
4                   One Flew Over the Cuckoo's Nest (1975)         1725
5                   One Flew Over the Cuckoo's Nest (1975)         1725
6                   One Flew Over the Cuckoo's Nest (1975)         1725
7                   One Flew Over the Cuckoo's Nest (1975)         1725
8                   One Flew Over the Cuckoo's Nest (1975)         1725
9                   One Flew Over the Cuckoo's Nest (1975)         1725
10                  One Flew Over the Cuckoo's Nest (1975)         1725
11                  One Flew Over the Cuckoo's Nest (1975)         1725
12                  One Flew Over the Cuckoo's Nest (1975)         1725
13                  One Flew Over the Cuckoo's Nest (1975)         1725
14                  One Flew Over the Cuckoo's Nest (1975)         1725
15                  One Flew Over the Cuckoo's Nest (1975)         1725
16                  One Flew Over the Cuckoo's Nest (1975)         1725
17                  One Flew Over the Cuckoo's Nest (1975)         1725
18                  One Flew Over the Cuckoo's Nest (1975)         1725
19                  One Flew Over the Cuckoo's Nest (1975)         1725
20                  One Flew Over the Cuckoo's Nest (1975)         1725
21                  One Flew Over the Cuckoo's Nest (1975)         1725
22                  One Flew Over the Cuckoo's Nest (1975)         1725
23                  One Flew Over the Cuckoo's Nest (1975)         1725
24                  One Flew Over the Cuckoo's Nest (1975)         1725
25                  One Flew Over the Cuckoo's Nest (1975)         1725
26                  One Flew Over the Cuckoo's Nest (1975)         1725
27                  One Flew Over the Cuckoo's Nest (1975)         1725
28                  One Flew Over the Cuckoo's Nest (1975)         1725
29                  One Flew Over the Cuckoo's Nest (1975)         1725
...                                                    ...          ...
1000179                                   Home Page (1999)            2
1000180                            Juno and Paycock (1930)            1
1000181                                Detroit 9000 (1973)            1
1000182                               Condition Red (1995)            1
1000183                               Stranger, The (1994)            2
1000184                               Stranger, The (1994)            2
1000185                                  Truce, The (1996)            2
1000186                                  Truce, The (1996)            2
1000187  Brother Minister: The Assassination of Malcolm...            4
1000188  Brother Minister: The Assassination of Malcolm...            4
1000189  Brother Minister: The Assassination of Malcolm...            4
1000190  Brother Minister: The Assassination of Malcolm...            4
1000191                          Six Ways to Sunday (1997)            2
1000192                          Six Ways to Sunday (1997)            2
1000193                            Tough and Deadly (1995)            2
1000194                            Tough and Deadly (1995)            2
1000195                                       Lured (1947)            1
1000196                               Outside Ozona (1998)            1
1000197                              Chain of Fools (2000)            1
1000198  Silence of the Palace, The (Saimt el Qusur) (1...            1
1000199                             Song of Freedom (1936)            1
1000200                     Slappy and the Stinkers (1998)            1
1000201                           Nemesis 2: Nebula (1995)            1
1000202                          Smoking/No Smoking (1993)            1
1000203                                 Modulations (1998)            2
1000204                                 Modulations (1998)            2
1000205                              Broken Vessels (1998)            1
1000206                                  White Boys (1999)            1
1000207                           One Little Indian (1973)            1
1000208        Five Wives, Three Secretaries and Me (1998)            1

[1000209 rows x 5 columns]

In [11]:
pd.set_option('display.float_format', lambda x: '%.3f' % x)
print(movie_ratingCount['totalRating'].describe())

count   3706.000
mean     269.889
std      384.048
min        1.000
25%       33.000
50%      123.500
75%      350.000
max     3428.000
Name: totalRating, dtype: float64

In [12]:
print(movie_ratingCount['totalRating'].quantile(np.arange(.9,1,.01)))

0.900    729.500
0.910    773.550
0.920    825.000
0.930    887.300
0.940    971.400
0.950   1051.500
0.960   1133.800
0.970   1268.100
0.980   1446.600
0.990   1784.900
Name: totalRating, dtype: float64

In [30]:
threshold = 200
rating_popular_movie = movie_ratingCount.query('totalRating >= @threshold')
print(rating_popular_movie)

                                                  Title  totalRating
3                                    'burbs, The (1989)          303
6                     10 Things I Hate About You (1999)          700
7                                 101 Dalmatians (1961)          565
8                                 101 Dalmatians (1996)          364
9                                   12 Angry Men (1957)          616
10                             13th Warrior, The (1999)          750
12                          2 Days in the Valley (1996)          286
14                  20,000 Leagues Under the Sea (1954)          575
16                         2001: A Space Odyssey (1968)         1716
17                                          2010 (1984)          470
20                                       28 Days (2000)          505
24                                 39 Steps, The (1935)          253
28                                            54 (1998)          259
29                     7th Voyage of Sinbad, The (1958)          258
30                                         8 1/2 (1963)          228
34                                           8MM (1999)          272
36         Abbott and Costello Meet Frankenstein (1948)          206
39                           About Last Night... (1986)          326
41                  Absent Minded Professor, The (1961)          380
42                                Absolute Power (1997)          380
43                                    Abyss, The (1989)         1715
44                    Ace Ventura: Pet Detective (1994)          766
45                Ace Ventura: When Nature Calls (1995)          389
51                          Addams Family Values (1993)          463
52                            Addams Family, The (1991)          714
53                              Addicted to Love (1997)          240
56                     Adventures in Babysitting (1987)          541
57    Adventures of Buckaroo Bonzai Across the 8th D...          611
61    Adventures of Priscilla, Queen of the Desert, ...          469
62                 Adventures of Robin Hood, The (1938)          378
...                                                 ...          ...
3630                                 Wild Things (1998)          626
3631                              Wild Wild West (1999)          902
3633      William Shakespeare's Romeo and Juliet (1996)          479
3634                                      Willow (1988)          802
3635       Willy Wonka and the Chocolate Factory (1971)         1313
3641    Wings of Desire (Der Himmel über Berlin) (1987)          242
3642                      Wings of the Dove, The (1997)          218
3643        Winnie the Pooh and the Blustery Day (1968)          221
3652                                 With Honors (1994)          228
3655                                     Witness (1985)         1046
3656                           Wizard of Oz, The (1939)         1718
3657                                        Wolf (1994)          272
3662   Women on the Verge of a Nervous Breakdown (1988)          353
3664                                 Wonder Boys (2000)          496
3671                                Working Girl (1988)          514
3672                    World Is Not Enough, The (1999)          862
3675                         Wrong Trousers, The (1993)          882
3677                                  Wyatt Earp (1994)          270
3678              X-Files: Fight the Future, The (1998)          996
3679                                       X-Men (2000)         1511
3685                  Year of Living Dangerously (1982)          391
3687                            Yellow Submarine (1968)          399
3688                                     Yojimbo (1961)          215
3691                             You've Got Mail (1998)          838
3693                          Young Frankenstein (1974)         1193
3694                                  Young Guns (1988)          562
3695                               Young Guns II (1990)          369
3697                       Young Sherlock Holmes (1985)          379
3702                                 Zero Effect (1998)          301
3705                                    eXistenZ (1999)          410

[1426 rows x 2 columns]

In [31]:
rating_with_totalRating_pivot = rating_with_totalRating.pivot(index='Title',columns='UserID',values='Rating').fillna(0)
rating_with_totalRating_matrix = csr_matrix(rating_with_totalRating_pivot.values)

In [33]:
#print(rating_with_totalRating_matrix)

In [34]:
from sklearn.neighbors import NearestNeighbors
model_knn = NearestNeighbors(metric='cosine',algorithm = 'brute')
model_knn.fit(rating_with_totalRating_matrix)

NearestNeighbors(algorithm='brute', leaf_size=30, metric='cosine',
         metric_params=None, n_jobs=None, n_neighbors=5, p=2, radius=1.0)

In [37]:
query_index = np.random.choice(rating_with_totalRating_pivot.shape[0])
distances, indices = model_knn.kneighbors(rating_with_totalRating_pivot.iloc[query_index, :].values.reshape(1, -1), n_neighbors = 10)

for i in range(0, len(distances.flatten())):
    if i == 0:
        print('Recommendations for {0}:\n'.format(rating_with_totalRating_pivot.index[query_index]))
    else:
        print('{0}: {1}, with distance of {2}:'.format(i, rating_with_totalRating_pivot.index[indices.flatten()[i]], distances.flatten()[i]))

Recommendations for Fire Down Below (1997):

1: Glimmer Man, The (1996), with distance of 0.4485907943367682:
2: Under Siege 2: Dark Territory (1995), with distance of 0.5583336424138674:
3: Double Team (1997), with distance of 0.6101772279100419:
4: Marked for Death (1990), with distance of 0.6602491614712881:
5: Maximum Risk (1996), with distance of 0.6647367695500201:
6: Death Wish 3 (1985), with distance of 0.6757022648654121:
7: Hard Rain (1998), with distance of 0.6789478144470118:
8: Striking Distance (1993), with distance of 0.6823395539008346:
9: Under Siege (1992), with distance of 0.6846066181967783: